#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.archive_file.lambda_package: Reading...
data.aws_iam_policy_document.lambda: Reading...
data.aws_iam_policy_document.lambda_permissions: Reading...
data.aws_iam_policy_document.lambda_logging: Reading...
data.aws_iam_policy_document.lambda_permissions: Read complete after 0s [id=3717859975]
data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=1779473963]
data.aws_iam_policy_document.lambda: Read complete after 0s [id=3693445097]
aws_dynamodb_table.tasks: Refreshing state... [id=eisenhower-api-test-tasks]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::757214766189:policy/eisenhower-api-test-lambda-logging]
aws_iam_role.lambda: Refreshing state... [id=eisenhower-api-test-lambda]
aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::757214766189:policy/eisenhower-api-test-lambda-permissions]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=eisenhower-api-test-lambda-20230423075106448900000001]
aws_iam_role_policy_attachment.lambda: Refreshing state... [id=eisenhower-api-test-lambda-20230423075106460700000002]
data.archive_file.lambda_package: Read complete after 2s [id=2c674fb582abaf72333a650912109afa1fc47fdc]
aws_lambda_function.monolith: Refreshing state... [id=eisenhower-api-test-monolith]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.monolith will be updated in-place
  ~ resource "aws_lambda_function" "monolith" {
        id                             = "eisenhower-api-test-monolith"
      ~ last_modified                  = "2023-04-23T22:00:30.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:757214766189:function:eisenhower-api-test-monolith:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:757214766189:function:eisenhower-api-test-monolith:6/invocations" -> (known after apply)
      ~ source_code_hash               = "JzOQbDNClndOKwgWH3v9pMgNLQvflyuHWDC4le0/RfU=" -> "vQjyDa6RN2CO7lcqCFu+0YaEDFhRU64/A5wJFHhsafM="
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Workflow: `Integration Pipeline`*